Второе задание по курсу "Методы и инструменты ИИ в веб".

Я сделал это задание по следующим критериям:

- Есть ссылка на вёрстку и исходные макеты - https://figma.community/files/file/954-shablon-nike-shoes-app-dlya-figma/

- Свёрстаны два экрана

- В стилях использованы CSS-переменные

- В стилях использованы псевдоклассы и псевдоэлементы

- Как минимум на одном из экранов элементов позиционируются с помощью display: flex / display: grid

- В стилях присутствуют сложные / составные селекторы (это все остальные, помимо селекторов тегов, классов и идентификаторов)

- Вёрстка должна соответствовать выбранным макетам

- Вёрстка адаптирована под десктоп, планшет и мобильные устройства (+5 баллов)
